Repository: FreeSlave/def2fgd
Catalog: po/*.po
Languages: ru

source: Usage: %s [options] [input-file] [output-file] -format format specify format of input: def or ent -offset-glob pattern add offset to entities matching given pattern; this option can be passed multiple times -noauto-offset-glob don't use default patterns when setting offset -bob same as -bobparms "180 8 0" -bobparms "x y z" set bob parameters -bob-glob pattern add bobparms to entities matching given pattern; this option can be passed multiple times -noauto-bob-glob don't use default patterns when setting bobparms -help display this help and exit -version show version information and exit -- [arguments...] treat the rest of arguments as positional arguments When input-file is omitted or -, read standard input. When output-file is omitted or -, write to standard output.
ru: Использование: %s [параметры] [входной файл] [выходной файл] -format формат формат входных данных: def или ent -offset-glob шаблон добавить сдвиг для энтить, соответствующих указанному шаблону; опция может быть указана несколько раз -noauto-offset-glob не использовать шаблоны по умолчанию для установки сдвига; -bob то же самое, что -bobparms "180 8 0" -bobparms "x y z" параметры вращения -bob-glob шаблон добавить параметры вращения для энтить, соответствующих указанному шаблону опция может быть указана несколько раз -noauto-bob-glob не использовать шаблоны по умолчанию для установки параметров вращения -help показать справку и выйти -version показать версию и выйти -- [аргументы...] считать оставшуюся часть параметров позиционными аргументами Когда входной файл не задан или равняется -, используется стандартный поток ввода. Когда выходной файл не задан или равняется -, используется стандартный поток вывода.

source: Use %s -help to get help.
ru: Используйте %s -help, чтобы получить помощь.

source: Bob parameters already set to ( %d %d %d ). Remove redundant argument
ru: Параметры вращения уже установлен в ( %d %d %d ). Удалите лишний аргумент

source: -format option repetition
ru: Повторение опции -format

source: -format requires argument
ru: Опция -format ожидает аргумент

source: -bobparms requires argument
ru: Опция -bobparms ожидает аргумент

source: -offset-glob requires argument
ru: Опция -offset-glob ожидает аргумент

source: -bob-glob requires argument
ru: Опция -bob-glob ожидает аргумент

source: Unknown parameter: %s
ru: Неизвестный параметр: %s

source: Could not detect input format. Use -format option to explicitly set it.
ru: Не удалось определить формат входных данных. Используйте опцию -format, чтобы явно задать формат.

source: No input file name nor format given.
ru: Не заданы ни имя входного файла, ни формат.

source: Could not open file %s for reading: %s
ru: Не удалось открыть файл %s для чтения: %s

source: Unknown format '%s'
ru: Неизвестный формат '%s'

source: Could not open file %s for writing: %s
ru: Не удалось открыть файл %s для записи: %s

source: %s:%d:%d: error: %s
ru: %s:%d:%d ошибка: %s

source: %d:%d: error: %s
ru: %d:%d: ошибка: %s

source: Error: %s
ru: Ошибка: %s
